import org.apache.spark.sql.SparkSession

object TFExample {
  def main(args: Array[String]): Unit = {
    import org.apache.spark.ml.feature.{HashingTF, IDF, Tokenizer}

    val spark = SparkSession
      .builder()
      .master("local[*]")
      .appName("Spark SQL basic example")
      .getOrCreate()

    val sentenceData = spark.createDataFrame(Seq(
      (0.0, "Привет я слышал о Спарк"),
      (0.0, "Привет я слышал о Спарке"),
      (0.0, "Привет я слышала о Спарк"),
      (0.0, "Привет я слышал о Яве"),
      (0.0, "Здаров я слышал о Спарк"),
      (0.0, "Здаров я тоже слышал о Котиках"),
      (0.0, "Здарова я тоже слышал о Котиках"),

//      (0.0, "Hi I heard about Spark"),
//      (0.0, "Hi I heard about Java"),
//      (0.0, "Hello I heard about Spark"),
//      (0.0, "I wish Java could use case classes"),
//      (1.0, "Logistic regression models are neat")
    )).toDF("label", "sentence")

    val tokenizer = new Tokenizer().setInputCol("sentence").setOutputCol("words")
    val wordsData = tokenizer.transform(sentenceData)

    val hashingTF = new HashingTF()
      .setInputCol("words").setOutputCol("rawFeatures").setNumFeatures(20)

    val featurizedData = hashingTF.transform(wordsData)
    // alternatively, CountVectorizer can also be used to get term frequency vectors

    val idf = new IDF().setInputCol("rawFeatures").setOutputCol("features")
    val idfModel = idf.fit(featurizedData)

    val rescaledData = idfModel.transform(featurizedData)
    rescaledData.select("label", "features").show()


    rescaledData.show(truncate = false)
//   val a =  rescaledData.select("features").first().
  }



    //eng seq input
//  +-----+-------------------------+-------------------------------+----------------------------------+----------------------------------------------------------------------------------------------+
//  |label|sentence                 |words                          |rawFeatures                       |features                                                                                      |
//  +-----+-------------------------+-------------------------------+----------------------------------+----------------------------------------------------------------------------------------------+
//  |0.0  |Hi I heard about Spark   |[hi, i, heard, about, spark]   |(20,[6,8,13,16],[1.0,1.0,1.0,2.0])|(20,[6,8,13,16],[0.4054651081081644,0.6931471805599453,0.1823215567939546,0.3646431135879092])|
//  |0.0  |Hi I heard about Java    |[hi, i, heard, about, java]    |(20,[7,8,13,16],[1.0,1.0,1.0,2.0])|(20,[7,8,13,16],[0.6931471805599453,0.6931471805599453,0.1823215567939546,0.3646431135879092])|
//  |0.0  |Hello I heard about Spark|[hello, i, heard, about, spark]|(20,[6,9,13,16],[1.0,1.0,1.0,2.0])|(20,[6,9,13,16],[0.4054651081081644,1.0986122886681098,0.1823215567939546,0.3646431135879092])|
//  +-----+-------------------------+-------------------------------+----------------------------------+----------------------------------------------------------------------------------------------+
//  only showing top 3 rows


//  +-----+-------------------------------+--------------------------------------+------------------------------------------+----------------------------------------------------------------------------------------+
//  |label|sentence                       |words                                 |rawFeatures                               |features                                                                                |
//  +-----+-------------------------------+--------------------------------------+------------------------------------------+----------------------------------------------------------------------------------------+
//  |0.0  |Привет я слышал о Спарк        |[привет, я, слышал, о, спарк]         |(20,[5,7,9,11,17],[1.0,1.0,1.0,1.0,1.0])  |(20,[5,7,9,11,17],[0.13353139262452257,0.6931471805599453,0.47000362924573563,0.0,0.0]) |
//  |0.0  |Привет я слышал о Спарке       |[привет, я, слышал, о, спарке]        |(20,[5,9,11,15,17],[1.0,1.0,1.0,1.0,1.0]) |(20,[5,9,11,15,17],[0.13353139262452257,0.47000362924573563,0.0,1.3862943611198906,0.0])|
//  |0.0  |Привет я слышала о Спарк       |[привет, я, слышала, о, спарк]        |(20,[7,9,11,17,19],[1.0,1.0,1.0,1.0,1.0]) |(20,[7,9,11,17,19],[0.6931471805599453,0.47000362924573563,0.0,0.0,1.3862943611198906]) |
//  |0.0  |Привет я слышал о Яве          |[привет, я, слышал, о, яве]           |(20,[5,9,11,16,17],[1.0,1.0,1.0,1.0,1.0]) |(20,[5,9,11,16,17],[0.13353139262452257,0.47000362924573563,0.0,0.6931471805599453,0.0])|
//  |0.0  |Здаров я слышал о Спарк        |[здаров, я, слышал, о, спарк]         |(20,[5,7,10,11,17],[1.0,1.0,1.0,1.0,1.0]) |(20,[5,7,10,11,17],[0.13353139262452257,0.6931471805599453,0.9808292530117262,0.0,0.0]) |
//  |0.0  |Здаров я тоже слышал о Котиках |[здаров, я, тоже, слышал, о, котиках] |(20,[5,10,11,16,17],[1.0,1.0,1.0,1.0,2.0])|(20,[5,10,11,16,17],[0.13353139262452257,0.9808292530117262,0.0,0.6931471805599453,0.0])|
//  |0.0  |Здарова я тоже слышал о Котиках|[здарова, я, тоже, слышал, о, котиках]|(20,[5,11,16,17],[1.0,1.0,1.0,3.0])       |(20,[5,11,16,17],[0.13353139262452257,0.0,0.6931471805599453,0.0])                      |
//  +-----+-------------------------------+--------------------------------------+------------------------------------------+----------------------------------------------------------------------------------------+
}
